// ----------------------------------------------------------------------------
// интерфейс для объекта, передающего параметры активной страницы
// ----------------------------------------------------------------------------
export interface IBrand {

  // имя класса для выделения кнопки с логотипом
  back: string,

  // имя класса для выделения логотипа
  icon: string,

  // имя класса для выделения кнопки активной страницы
  routerLinkActive: string

} // interface IBrand
// ----------------------------------------------------------------------------
