// ----------------------------------------------------------------------------
// интерфейс объекта с параметрами компонента NotFoundComponent
// ----------------------------------------------------------------------------
export interface INotFoundComponent {

  // заголовок
  title: string,

  // параметр языка отображения
  language: string,

  // параметр, передающий маршрут в родительский компонент
  route: string

} // interface INotFoundComponent
// ----------------------------------------------------------------------------
