// ----------------------------------------------------------------------------
// интерфейс объекта с параметрами компонента NotFoundComponent
// ----------------------------------------------------------------------------
export interface INotFoundComponent {

  //#region параметры меняющиеся при смене языка

  // заголовок
  title: string,

  //endregion


  //#region параметры НЕ меняющиеся при смене языка

  // параметр языка отображения
  language: string,

  // параметр, передающий маршрут в родительский компонент
  route: string

  //endregion

} // interface INotFoundComponent
// ----------------------------------------------------------------------------
